//-----------------------------------------------------------------------------
//
//      Класс отсутствия отрисовки элемента если элемент невидим
//      (c) РГУПС, ВЖД 05/07/2017
//      Разработал: Ковшиков С. В.
//
//-----------------------------------------------------------------------------
/*!
 *  \file
 *  \brief Класс отсутствия отрисовки элемента если элемент невидим
 *  \copyright РГУПС, ВЖД
 *  \author Ковшиков С. В.
 *  \date 05/07/2017
 */

#include "element-nodraw-engine.h"


//-----------------------------------------------------------------------------
// КОНСТРУКТОР
//-----------------------------------------------------------------------------
ElementNoDrawEngine::ElementNoDrawEngine(AbstractElement *elem)
    : AbstractElementDrawEngine(elem)
{

}



//-----------------------------------------------------------------------------
// Отрисовка элемента
//-----------------------------------------------------------------------------
void ElementNoDrawEngine::drawElement()
{
    // do nothing =)
}
